{
	"Perspectiva":"Externa",
  	"Analizabilidad": [
	  		{
              "id": 79,
              "subcaracteristica" : "Analizabilidad",
              "nombre": "Capacidad de seguimiento de auditoría",
              "proposito": [
                  "¿Puede el usuario identificar una operación específica que causó falla?", 
                  "¿Puede el mantenedor encontrar fácilmente una operación específica que causó falla?"
              ],
              "metodo": "Observe el comportamiento del usuario o del mantenedor que intenta resolver los fallos.",
              "formula": ["A/B"],
              "peor_valor": 0,
              "mejor_valor": 1,
              "parametros": [
                "A",
                "B"
              ],
              "desc_param": [
                "A: Número de datos realmente grabados durante la operación.",
                "B: Número de datos programados para ser registrados lo suficiente como para monitorizar el estado del software durante el funcionamiento."
              ]
            },
            {
              "id": 80,
              "subcaracteristica" : "Analizabilidad",
              "nombre": "Soporte de la función de diagnóstico",
              "proposito": [
                  "¿Cuán capaces son las funciones diagnósticas al apoyar el análisis causal?", 
                  "¿Puede el usuario identificar la operación específica que causó el fallo? (El usuario puede Evitar caer de nuevo en la misma ocurrencia de falla con una operación alternativa).", 
                  "¿Puede el mantenedor encontrar fácilmente la causa del fracaso?"
              ],
              "metodo": "Observar el comportamiento del usuario o mantenedor que está tratando de resolver las fallas utilizando funciones de diagnóstico.",
              "formula": ["A/B"],
              "peor_valor": 0,
              "mejor_valor": 1,
              "parametros": [
                "A",
                "B"
              ],
              "desc_param": [
                "A: Número de fallas que el mantenedor puede diagnosticar (utilizando la función de diagnóstico) para comprender la relación causa-efecto.",
                "B: Número total de fallos registrados."
              ]
            },
            {
              "id": 81,
              "subcaracteristica" : "Analizabilidad",
              "nombre": "Capacidad de análisis de fallas",
              "proposito": [
                  "¿Puede el usuario identificar una operación específica que causó falla?", 
                  "¿Puede el mantenedor encontrar fácilmente la causa del fracaso?"
              ],
              "metodo": "Observe el comportamiento del usuario o del mantenedor que intenta resolver los fallos.",
              "formula": ["1 - A/B"],
              "peor_valor": 0,
              "mejor_valor": 1,
              "parametros": [
                "A",
                "B"
              ],
              "desc_param": [
                "A: Número de fallos cuyas causas aún no se encuentran.",
                "B: Número total de fallos registrados."
              ]
            },
            {
              "id": 82,
              "subcaracteristica" : "Analizabilidad",
              "nombre": "Eficacia del análisis de fallos",
              "proposito": [
                  "¿Puede el usuario analizar eficientemente la causa del fallo? (A veces el usuario realiza el mantenimiento estableciendo los parámetros.)", 
                  "¿Puede el mantenedor encontrar fácilmente la causa del fracaso?", 
                  "¿Qué tan fácil es analizar la causa del fracaso?"
              ],
              "metodo": "Observe el comportamiento del usuario o del mantenedor que intenta resolver los fallos.",
              "formula": ["(Sum(Tout)-Sum(Tin))/N"],
              "peor_valor": 10000,
              "mejor_valor": 0,
              "parametros": [
                "Tout",
                "Tin",
                "N"
              ],
              "desc_param": [
                "Tout: Tiempo en el que se descubren las causas del fallo (o se informa al usuario).",
                "Tin: Tiempo en que se recibe el informe de fallo.",
                "N: Número de fallos registrados."
              ]
            },
            {
              "id": 83,
              "subcaracteristica" : "Analizabilidad",
              "nombre": "Supervisión del estado de la capacidad",
              "proposito": [
                  "¿Puede el usuario identificar una operación específica que causó falla al obtener datos monitorizados durante el funcionamiento?", 
                  "¿Puede el mantenedor encontrar fácilmente la causa del fallo obteniendo datos monitorizados durante la operación?"
              ],
              "metodo": "Observe el comportamiento del usuario o del mantenedor que intenta obtener el estado de registro de datos supervisados del software durante el funcionamiento",
              "formula": ["1 - A/B"],
              "peor_valor": 0,
              "mejor_valor": 1,
              "parametros": [
                "A",
                "B"
              ],
              "desc_param": [
                "A: Número de casos en los que el mantenedor (o usuario) no pudo obtener los datos del monitor.",
                "B: Número de casos en los que el mantenedor (o usuario) intentó obtener el estado de registro de los datos del monitor del software durante la operación."
              ]
            }
   	],
  	"Modificabilidad": [
  			{
              "id": 84,
              "subcaracteristica" : "Modificabilidad",
              "nombre": "Cambio de la eficiencia del ciclo",
              "proposito": ["¿Se puede resolver el problema del usuario a su satisfacción dentro de una escala de tiempo aceptable?"],
              "metodo": "Supervisar la interacción entre el usuario y el proveedor. Registre el tiempo transcurrido desde la solicitud inicial del usuario hasta la resolución del problema.",
              "formula": ["(Sum(Trc)-Sum(Tsn))/N"],
              "peor_valor": 100000,
              "mejor_valor": 0,
              "parametros": [
                "Trc",
                "Tsn",
                "N"
              ],
              "desc_param": [
                "Trc: Tiempo en el que el usuario terminó de enviar solicitud de mantenimiento al proveedor con informe de problema.",
                "Tsn: Hora en que el usuario recibió la versión revisada (o informe de estado).",
                "N: Número de versiones revisadas."
              ]
            },
            {
              "id": 85,
              "subcaracteristica" : "Modificabilidad",
              "nombre": "Cambio del tiempo de ejecución de la implementación",
              "proposito": ["¿Puede el mantenedor cambiar fácilmente el software para resolver el problema de falla?"],
              "metodo": "Observe el comportamiento del usuario o del mantenedor mientras intenta cambiar el software. Registre el tiempo transcurrido desde la solicitud inicial del usuario hasta la resolución del problema.",
              "formula": ["(Sum(Tout)-Sum(Tin))/N"],
              "peor_valor": 100000,
              "mejor_valor": 0,
              "parametros": [
                "Tout",
                "Tin",
                "N"
              ],
              "desc_param": [
                "Tout: Tiempo en el que se eliminan las causas del fallo con el cambio del software (o el estado se devuelve al usuario).",
                "Tin: Tiempo en que se descubren las causas de los fallos.",
                "N: Número de fallos registrados y eliminados."
              ]
            },
            {
              "id": 86,
              "subcaracteristica" : "Modificabilidad",
              "nombre": "Complejidad de la Modificación",
              "proposito": ["¿Puede el mantenedor cambiar fácilmente el software para resolver el problema?"],
              "metodo": "Observe el comportamiento del mantenedor que intenta cambiar el software.",
              "formula": ["(Sum(A)/Sum(B))/N"],
              "peor_valor": 100000,
              "mejor_valor": 0,
              "parametros": [
                "A",
                "B",
                "N"
              ],
              "desc_param": [
                "A: Tiempo de trabajo gastado en el cambio.",
                "B: Tamaño del cambio de software.",
                "N: Número de cambios."
              ]
            },
            {
              "id": 87,
              "subcaracteristica" : "Modificabilidad",
              "nombre": "Modificabilidad parametrizada",
              "proposito": ["¿Puede el usuario o el mantenedor cambiar fácilmente el parámetro para cambiar el software y resolver problemas?"],
              "metodo": "Observe el comportamiento del usuario o del mantenedor mientras intenta cambiar el software.",
              "formula": ["1 - A/B"],
              "peor_valor": 0,
              "mejor_valor": 1,
              "parametros": [
                "A",
                "B"
              ],
              "desc_param": [
                "A: Número de casos en los que el mantenedor no cambia de software usando el parámetro.",
                "B: Número de casos en los que el mantenedor intenta cambiar el software usando el parámetro."
              ]
            },
            {
              "id": 88,
              "subcaracteristica" : "Modificabilidad",
              "nombre": "Capacidad de control de cambio de software",
              "proposito": [
                  "¿Puede el usuario identificar fácilmente versiones revisadas?", 
                  "¿Puede el mantenedor cambiar fácilmente el software para resolver problemas?"
              ],
              "metodo": "Observe el comportamiento del usuario o del mantenedor mientras intenta cambiar el software.",
              "formula": ["A/B"],
              "peor_valor": 0,
              "mejor_valor": 1,
              "parametros": [
                "A",
                "B"
              ],
              "desc_param": [
                "A: Número de datos del registro de cambios realmente registrados.",
                "B: Número de datos del registro de cambios que se planea registrar lo suficiente como para rastrear los cambios de software."
              ]
            }
  	],
  	"Estabilidad" : [
            {
              "id": 89,
              "subcaracteristica" : "Estabilidad",
              "nombre": "Localización del impacto de una modificación (Fracaso emergente después del cambio)",
              "proposito": [
                  "¿Puede el usuario operar el sistema de software sin fallas después del mantenimiento?",
                  "¿Puede el facilitador mitigar fácilmente los fallos causados por los efectos secundarios de mantenimiento?"
              ],
              "metodo": "Cuente la ocurrencia de los fallos después del cambio, que se encadenan mutuamente y se ven afectados por el cambio.",
              "formula": ["A/B"],
              "peor_valor": 10000,
              "mejor_valor": 0,
              "parametros": [
                "A",
                "N"
              ],
              "desc_param": [
                "A: Número de fallas surgidas después de la falla que se resolvieron por el cambio durante el período especificado.",
                "N: Número de fallos resueltos."
              ]
            }
	],
	"Testeabilidad": [
			{
              "id": 90,
              "subcaracteristica" : "Testeabilidad",
              "nombre": "Disponibilidad de la función de prueba incorporada",
              "proposito": ["¿Puede el usuario y el mantenedor realizar fácilmente pruebas operativas sin preparación adicional de la instalación de prueba?"],
              "metodo": "Observe el comportamiento del usuario o del mantenedor que está probando el sistema de software después del mantenimiento.",
              "formula": ["A/B"],
              "peor_valor": 0,
              "mejor_valor": 1,
              "parametros": [
                "A",
                "B"
              ],
              "desc_param": [
                "A: Número de casos en los que el mantenedor puede utilizar la función de prueba incorporada adecuadamente.",
                "B: Número de oportunidades de casos de prueba."
              ]
            },
            {
              "id": 91,
              "subcaracteristica" : "Testeabilidad",
              "nombre": "Eficiencia de volver a probar",
              "proposito": ["¿Puede el usuario y el mantenedor realizar fácilmente pruebas operacionales y determinar si el software está listo para funcionar o no?"],
              "metodo": "Observe el comportamiento del usuario o mantenedor que está probando el sistema de software después del mantenimiento.",
              "formula": ["Sum(T)/N"],
              "peor_valor": 10000,
              "mejor_valor": 0,
              "parametros": [
                "T",
                "N"
              ],
              "desc_param": [
                "T: Tiempo dedicado a la prueba para asegurarse de que el fallo notificado se resolvió o no",
                "N: Número de fallos resueltos"
              ]
            },
            {
              "id": 92,
              "subcaracteristica" : "Testeabilidad",
              "nombre": "Capacidad de volver a empezar la prueba",
              "proposito": ["¿Puede el usuario y el mantenedor realizar fácilmente pruebas operativas con puntos de verificación después del mantenimiento?"],
              "metodo": "Observe el comportamiento del usuario o mantenedor que está probando el sistema de software después del mantenimiento.",
              "formula": ["A/B"],
              "peor_valor": 0,
              "mejor_valor": 1,
              "parametros": [
                "A",
                "B"
              ],
              "desc_param": [
                "A: Número de casos en los que el mantenedor puede pausar y reiniciar la ejecución de la prueba en los puntos deseados para comprobar paso a paso.",
                "B: Número de casos de pausas de ejecución de la prueba."
              ]
            }
  	],
  	"CumplimientoMantenibilidad": [
  			{
              "id": 93,
              "subcaracteristica" : "Cumplimiento Mantenibilidad",
              "nombre": "Cumplimiento de la Mantenibilidad",
              "proposito": ["¿En qué medida es compatibles la mantenibildiad del producto de software a las regulaciones, normas y convenciones?"],
              "metodo": "Cuente el número de ítems que requieren cumplimiento que se han cumplido y compare con el número de ítems que requieren cumplimiento en la especificación.",
              "formula": ["1 - A/B"],
              "peor_valor": 0,
              "mejor_valor": 1,
              "parametros": [
                "A",
                "B"
              ],
              "desc_param": [
                "A: Número de elementos de cumplimiento de mantenibildiad especificados que no se han implementado durante las pruebas.",
                "B: Número total de elementos de cumplimiento de la facilidad de mantenimiento especificados."
              ]
            }
  	]
}