{
	"Perspectiva":"Externa",
  	"Comprensibilidad": [
			{
              "id": 0,
              "nombre": "Integridad de la descripción",
              "proposito": ["¿Qué proporción de funciones (o tipos de funciones) se entiende después de leer la descripción del producto?"],
              "metodo": ["Lleve a cabo la prueba del usuario y entrevista al usuario con cuestionarios u observe el comportamiento del usuario. Contar el número de funciones que se entienden adecuadamente y comparar con el número total de funciones en el producto."],
              "formula": ["A/B"],
              "peor_valor": 0,
              "mejor_valor": 1,
              "parametros": [
                "A",
                "B"
              ],
              "desc_param": [
                "A: Número de funciones (o tipos de funciones) entendidas.",
                "B: Número total de funciones (o tipos de funciones)."
              ]
            },
            {
            	"id": 1,
	            "nombre": "Accesibilidad de demostración",
	            "proposito": ["¿A qué proporción de las demostraciones/tutoriales puede acceder el usuario?"],
	            "metodo": ["Lleve a cabo la prueba del usuario y observe su comportamiento. Cuente el número de funciones que son adecuadamente demostrables y compárelas con el número total de funciones que requieren capacidad de demostración"],
	            "formula": ["A/B"],
	            "peor_valor": 0,
	            "mejor_valor": 1,
	            "parametros": [
	              "A",
	              "B"
	            ],
	            "desc_param": [
	              "A: Número de demostraciones/tutoriales a las que el usuario accede con éxito",
	              "B: Número de demostraciones/tutoriales disponibles"
              ]
            },
            {
            	"id": 2,
	            "nombre": "Accesibilidad de demostración en uso",
	            "proposito": ["¿Qué proporción de las demostraciones/tutoriales puede el usuario acceder cuando el usuario realmente necesita hacer durante la operación?"],
	            "metodo": ["Observe el comportamiento del usuario que intenta ver la demostración/tutorial. La observación puede emplear el enfoque de monitoreo de la acción cognitiva humana con cámara de video."],
	            "formula": ["A/B"],
	            "peor_valor": 0,
	            "mejor_valor": 1,
	            "parametros": [
	              "A",
	              "B"
	            ],
	            "desc_param": [
	              "A: Número de casos en los que el usuario muestra con éxito la demostración cuando el usuario intenta ver la demostración.",
	              "B: Número de casos en los que el usuario intenta ver la demostración durante el período de observación."
              ]
            },
            {
            	"id": 3,
	            "nombre": "Eficacia de la demostración",
	            "proposito": ["¿Qué proporción de las funciones que el usuario puede operar con éxito después de una demostración o tutorial?"],
	            "metodo": ["Observe el comportamiento del usuario que intenta ver la demostración / tutorial. La observación puede emplear el enfoque de monitoreo de la acción cognitiva humana con cámara de video."],
	            "formula": ["A/B"],
	            "peor_valor": 0,
	            "mejor_valor": 1,
	            "parametros": [
	              "A",
	              "B"
	            ],
	            "desc_param": [
	              "A: Número de funciones funcionadas correctamente.",
	              "B: Número de demostraciones/tutoriales a las que se accede."
              ]
            },
            {
            	"id": 4,
	            "nombre": "Funciones evidentes",
	            "proposito": ["¿Qué proporción de funciones (o tipos de funciones) puede ser identificada por el usuario en función de las condiciones de inicio?"],
	            "metodo": ["Lleve a cabo la prueba del usuario y entreviste al usuario con cuestionarios u observe su comportamiento. Cuente el número de funciones que son evidentes para el usuario y compare con el número total de funciones."],
	            "formula": ["A/B"],
	            "peor_valor": 0,
	            "mejor_valor": 1,
	            "parametros": [
	              "A",
	              "B"
	            ],
	            "desc_param": [
	              "A: Número de funciones (o tipos de funciones) identificadas por el usuario.",
	              "B: Número total de funciones reales (o tipos de funciones)."
              ]
            },
            {
            	"id": 5,
	            "nombre": "Función capacidad de comprensión",
	            "proposito": ["¿Qué proporción de las funciones del producto el usuario será capaz de entender correctamente?"],
	            "metodo": ["Lleve a cabo una prueba de usuario y entreviste a los usuarios con cuestionarios. Cuente el número de funciones de la interfaz de usuario donde los propósitos sean fácilmente comprendidos por el usuario y compare con el número de funciones disponibles para el usuario."],
	            "formula": ["A/B"],
	            "peor_valor": 0,
	            "mejor_valor": 1,
	            "parametros": [
	              "A",
	              "B"
	            ],
	            "desc_param": [
	              "A: Número de funciones de interfaz cuyo propósito es descrito correctamente por el usuario.",
	              "B: Número de funciones disponibles desde la interfaz."
              ]
            },
            {
            	"id": 6,
	            "nombre": "Entradas y salidas comprensibles",
	            "proposito": ["¿Pueden los usuarios entender lo que se requiere como datos de entrada y qué se proporciona como salida por el sistema de software?"],
	            "metodo": ["Lleve a cabo la prueba del usuario y entrevista al usuario con cuestionarios u observe el comportamiento del usuario. Cuente el número de elementos de datos de entrada y salida entendidos por el usuario y compararlos con el número total de ellos disponibles para el usuario."],
	            "formula": ["A/B"],
	            "peor_valor": 0,
	            "mejor_valor": 1,
	            "parametros": [
	              "A",
	              "B"
	            ],
	            "desc_param": [
	              "A: Número de elementos de datos de entrada y salida que el usuario entiende correctamente.",
	              "B: Número de elementos de datos de entrada y salida disponibles desde la interfaz."
              ]
            }
   	],
  	"Aprendizaje": [
			{
              "id": 0,
              "nombre": "Facilidad de aprendizaje de funciones",
              "proposito": ["¿Cuánto tarda el usuario en aprender a utilizar una función?"],
              "metodo": ["Lleve a cabo la prueba del usuario y observe su comportamiento."],
              "formula": ["T"],
              "peor_valor": 1000,
              "mejor_valor": 0,
              "parametros": [
                "T"
              ],
              "desc_param": [
                "T: Tiempo medio empleado para aprender a utilizar correctamente una función."
              ]
            },
            {
              "id": 1,
              "nombre": "Facilidad de aprendizaje para realizar una tarea en uso",
              "proposito": ["¿Cuánto tarda el usuario en aprender cómo realizar la tarea especificada de manera eficiente?"],
              "metodo": ["Observe el comportamiento del usuario desde cuando empiezan a aprender hasta que empiezan a funcionar eficientemente."],
              "formula": ["T"],
              "peor_valor": 1000,
              "mejor_valor": 0,
              "parametros": [
                "T"
              ],
              "desc_param": [
                "T: Suma del tiempo de operación del usuario hasta que el usuario logre realizar la tarea especificada en un tiempo corto "
              ]
            },
            {
              "id": 2,
              "nombre": "Eficacia de la documentación del usuario y / o del sistema de ayuda",
              "proposito": ["¿Qué proporción de tareas se puede completar correctamente después de usar la documentación del usuario y / o el sistema de ayuda?"],
              "metodo": ["Lleve a cabo la prueba del usuario y observe el comportamiento del usuario. Cuente el número de tareas completadas con éxito después de acceder a la ayuda y / o documentación en línea y compare con el número total de tareas probadas."],
              "formula": ["A/B"],
              "peor_valor": 0,
              "mejor_valor": 1,
              "parametros": [
                "A",
                "B"
              ],
              "desc_param": [
                "A: Número de tareas completadas con éxito después de acceder a la ayuda en línea y/o documentación.",
                "B: Total del número de tareas probadas."
              ]
            },
            {
              "id": 3,
              "nombre": "Eficacia de la documentación del usuario y / o sistemas de ayuda en uso",
              "proposito": ["¿Qué proporción de funciones se pueden utilizar correctamente después de leer la documentación o usar sistemas de ayuda?"],
              "metodo": ["Observe el comportamiento del usuario. Cuente el número de funciones utilizadas correctamente después de leer la documentación o utilizando sistemas de ayuda y comparar con el número total de funciones."],
              "formula": ["A/B"],
              "peor_valor": 0,
              "mejor_valor": 1,
              "parametros": [
                "A",
                "B"
              ],
              "desc_param": [
                "A: Tiempo medio empleado para aprender a utilizar correctamente una función.",
                "B: Número total de funciones proporcionadas."
              ]
            },
            {
              "id": 4,
              "nombre": "Ayuda a la accesibilidad",
              "proposito": ["¿Qué proporción de los temas de ayuda puede localizar el usuario?"],
              "metodo": ["Lleve a cabo la prueba del usuario y observe el comportamiento del usuario. Cuente el número de tareas para las que está localizada la ayuda en línea correcta y compare con el número total de tareas probadas."],
              "formula": ["A/B"],
              "peor_valor": 0,
              "mejor_valor": 1,
              "parametros": [
                "A",
                "B"
              ],
              "desc_param": [
                "A: Número de tareas para las que se encuentra la ayuda en línea correcta.",
                "B: Total del número de tareas probadas."
              ]
            },
            {
              "id": 5,
              "nombre": "Frecuencia de Ayuda",
              "proposito": ["¿Con qué frecuencia un usuario tiene que acceder a la ayuda para aprender la operación para completar su tarea?"],
              "metodo": ["Lleve a cabo la prueba del usuario y observe el comportamiento del usuario. Cuente el número de casos a los que un usuario accede para completar su tarea."],
              "formula": ["A"],
              "peor_valor": 1000,
              "mejor_valor": 0,
              "parametros": [
                "A"
              ],
              "desc_param": [
                "A: Número de accesos para ayudar hasta que un usuario complete su tarea."
              ]
            } 
  	],
  	"Operabilidad" : [
			{
              "id": 0,
              "nombre": "Consistencia operativa en el uso",
              "proposito": ["¿Qué tan consistente es el componente de la interfaz de usuario?"],
              "metodo": ["Observe el comportamiento del usuario y solicite la opinión."],
              "formula": ["1 - A/B"],
              "peor_valor": 0,
              "mejor_valor": 1,
              "parametros": [
                "A",
                "B"
              ],
              "desc_param": [
                "A: Número de mensajes o funciones que el usuario encontró inaceptablemente inconsistentes con la expectativa del usuario.",
                "B: Número de mensajes o funciones."
              ]
            },
            {
            	"id": 1,
	            "nombre": "Corrección de errores",
	            "proposito": ["¿Puede el usuario corregir fácilmente el error en las tareas?"],
	            "metodo": ["Lleve a cabo la prueba del usuario y observe su comportamiento."],
	            "formula": ["Tc-Ts"],
	            "peor_valor": 10000,
	            "mejor_valor": 0,
	            "parametros": [
	              "Tc",
	              "Ts"
	            ],
	            "desc_param": [
	              "Tc: Tiempo de completar la corrección de los errores de tipo especificados de la tarea realizada.",
	              "Ts: Tiempo de inicio de la corrección de errores de tipos especificados de la tarea realizada."
              ]
            },
            {
            	"id": 2,
	            "nombre": "Corrección de errores en uso",
	            "proposito": ["¿Puede el usuario recuperar fácilmente su entrada?"],
	            "metodo": ["Observe el comportamiento del usuario que está operando el software."],
	            "formula": ["A/B"],
	            "peor_valor": 0,
	            "mejor_valor": 1,
	            "parametros": [
	              "A",
	              "B"
	            ],
	            "desc_param": [
	              "A: Número de pantallas o formularios donde los datos de entrada se modificaron con éxito antes de ser elaborados",
	              "B: Número de pantallas o formularios en los que el usuario intentó modificar o cambiar los datos de entrada durante el tiempo de funcionamiento del usuario observado"
              ]
            },
            {
            	"id": 3,
	            "nombre": "Disponibilidad de Valor Predeterminado en uso",
	            "proposito": ["¿Puede el usuario seleccionar fácilmente valores de parámetros para su cómoda operación?"],
	            "metodo": ["Observe el comportamiento del usuario que está operando el software. Cuente cuántas veces el usuario intenta establecer o seleccionar valores de parámetros y falla, (porque el usuario no puede usar valores predeterminados proporcionados por el software)."],
	            "formula": ["1 - A/B"],
	            "peor_valor": 0,
	            "mejor_valor": 1,
	            "parametros": [
	              "A",
	              "B"
	            ],
	            "desc_param": [
	              "A: Número de veces que el usuario no puede establecer o seleccionar valores de parámetros en un período corto (porque el usuario no puede usar valores predeterminados proporcionados por el software)",
	              "B: Número total de veces que el usuario intenta establecer o seleccionar valores de parámetros"
              ]
            },
            {
            	"id": 4,
	            "nombre": "Comprensión del mensaje en uso",
	            "proposito": [
	            	"¿Puede el usuario entender fácilmente los mensajes del sistema de software?",
	            	"¿Hay algún mensaje que haya causado al usuario un retraso en la comprensión antes de iniciar la siguiente acción?",
	            	"¿Puede el usuario memorizar fácilmente un mensaje importante?"

	            ],
	            "metodo": ["Observe el comportamiento del usuario que está operando el software."],
	            "formula": ["A/UOT"],
	            "peor_valor": 10000,
	            "mejor_valor": 0,
	            "parametros": [
	              "A",
	              "B"
	            ],
	            "desc_param": [
	              "A: número de veces que el usuario hace una pausa durante un largo período o falla sucesivamente y repetidamente en la misma operación, debido a la falta de comprensión del mensaje.",
	              "UOT: Tiempo de funcionamiento del usuario (período de observación)"
              ]
            },
            {
            	"id": 5,
	            "nombre": "Mensajes de error autoexplicativos",
	            "proposito": ["¿En qué proporción de condiciones de error el usuario propone la acción de recuperación correcta?"],
	            "metodo": ["Lleve a cabo la prueba del usuario y observe su comportamiento."],
	            "formula": ["A/B"],
	            "peor_valor": 0,
	            "mejor_valor": 1,
	            "parametros": [
	              "A",
	              "B"
	            ],
	            "desc_param": [
	              "A: Número de condiciones de error para las que el usuario propone la acción de recuperación correcta.",
	              "B: Número de condiciones de error probadas."
              ]
            },
            {
            	"id": 6,
	            "nombre": "Recuperabilidad del error operativo en uso",
	            "proposito": ["¿Puede el usuario recuperar fácilmente su peor situación?"],
	            "metodo": ["Observe el comportamiento del usuario que está operando el software."],
	            "formula": ["1 - A/B"],
	            "peor_valor": 0,
	            "mejor_valor": 1,
	            "parametros": [
	              "A",
	              "B"
	            ],
	            "desc_param": [
	              "A: Número de situación recuperada sin éxito (después de un error o cambio del usuario) en el que el usuario no fue informado acerca de un riesgo por el sistema.",
	              "B: Número de errores o cambios de usuario."
              ]
            },
            {
            	"id": 7,
	            "nombre": "Tiempo entre operaciones de error humano en uso",
	            "proposito": ["¿Puede el usuario operar el software lo suficiente sin error humano?"],
	            "metodo": ["Observe el comportamiento del usuario que está operando el software."],
	            "formula": ["T/N"],
	            "peor_valor": 10000,
	            "mejor_valor": 0,
	            "parametros": [
	              "T",
	              "N"
	            ],
	            "desc_param": [
	              "T: Tiempo de operación durante la observación (O la suma del tiempo de operación entre las operaciones de error humano del usuario).",
	              "N: Número de ocurrencias de la operación de error humano del usuario."
              ]
            },
            {
            	"id": 8,
	            "nombre": "Capacidad de anular (Corrección de errores de usuario)",
	            "proposito": ["¿Con qué frecuencia el usuario corrige correctamente los errores de entrada?"],
	            "metodo": ["Lleve a cabo la prueba del usuario y observe su comportamiento."],
	            "formula": ["A/B"],
	            "peor_valor": 0,
	            "mejor_valor": 1,
	            "parametros": [
	              "A",
	              "B"
	            ],
	            "desc_param": [
	              "A: Número de errores de entrada que el usuario corrige correctamente.",
	              "B: Número de intentos para corregir errores de entrada."
              ]
            },
            {
            	"id": 9,
	            "nombre": "Personalización",
	            "proposito": [
	            	"¿Puede el usuario personalizar fácilmente los procedimientos de operación para su conveniencia?",
	            	"¿Puede un usuario, que instruye a los usuarios finales, configurar fácilmente plantillas de procedimientos de operaciones personalizadas para prevenir sus errores?",
	            	"¿Qué proporción de funciones se pueden personalizar?"
	            ],
	            "metodo": ["Lleve a cabo la prueba del usuario y observe su comportamiento."],
	            "formula": ["A/B"],
	            "peor_valor": 0,
	            "mejor_valor": 1,
	            "parametros": [
	              "A",
	              "B"
	            ],
	            "desc_param": [
	              "A: Número de funciones personalizadas con éxito.",
	              "B: Número de intentos de personalizar."
              	]
            },
            {
            	"id": 10,
	            "nombre": "Reducción del procedimiento de operación",
	            "proposito": ["¿Puede el usuario reducir fácilmente los procedimientos de operación para su comodidad?"],
	            "metodo": ["Cuente los trazos del usuario para la operación especificada y compárelos entre antes y después de la operación de personalización."],
	            "formula": ["1 - A/B"],
	            "peor_valor": 0,
	            "mejor_valor": 1,
	            "parametros": [
	              "A",
	              "B"
	            ],
	            "desc_param": [
	              "A: Número de procedimientos de operación reducidos después de la operación de personalización.",
	              "B: Número de procedimientos de operación antes de personalizar la operación."
              	]
            },
            {
            	"id": 11,
	            "nombre": "Accesibilidad física",
	            "proposito": ["¿Qué proporción de funciones pueden tener acceso los usuarios con discapacidades físicas?"],
	            "metodo": ["Lleve a cabo la prueba del usuario y observe el comportamiento del usuario."],
	            "formula": ["1 - A/B"],
	            "peor_valor": 0,
	            "mejor_valor": 1,
	            "parametros": [
	              "A",
	              "B"
	            ],
	            "desc_param": [
	              "A: Número de funciones con acceso exitoso.",
	              "B: Número de funciones."
              	]
            }
	],
	"Atractividad": [
			{
              "id": 0,
              "nombre": "Interacción atractiva",
              "proposito": ["¿Qué tan atractiva es la interfaz para el usuario?"],
              "metodo": ["Cuestionario a los usuarios."],
              "formula": ["Cuestionario para evaluar el atractivo de la interfaz a los usuarios, después de la experiencia de uso"],
              "peor_valor": 0,
              "mejor_valor": 0,
              "parametros": [ ],
              "desc_param": [ ]
            },
            {
            	"id": 1,
	            "nombre": "Aspecto de la interfaz",
	            "proposito": ["¿Qué proporción de elementos de interfaz se pueden personalizar en apariencia para la satisfacción del usuario?"],
	            "metodo": ["Lleve a cabo la prueba del usuario y observe el comportamiento del usuario."],
	            "formula": ["A/B"],
	            "peor_valor": 0,
	            "mejor_valor": 1,
	            "parametros": [
	              "A",
	              "B"
	            ],
	            "desc_param": [
	              "A: Número de elementos de la interfaz personalizada en apariencia a la satisfacción del usuario.",
	              "B: Número de elementos de la interfaz que el usuario desea personalizar."
              ]
            }
  	],
  	"CumplimientoUsabilidad": [
			{
              "id": 0,
              "nombre": "Cumplimiento de la Usabilidad",
              "proposito": ["¿Qué tan completamente el software se adhiere a las normas, convenciones, guías de estilo o las regulaciones relacionadas con la usabilidad?"],
              "metodo": ["Especifique los elementos de cumplimiento requeridos basados en estándares, convenciones, guías de estilo o regulaciones relacionadas con la usabilidad."],
              "formula": ["1 - A/B"],
              "peor_valor": 0,
              "mejor_valor": 1,
              "parametros": [
                "A",
                "B"
              ],
              "desc_param": [
                "A: Número de elementos de cumplimiento de usabilidad especificados que no se han implementado durante las pruebas.",
                "B: Número total de elementos de cumplimiento de usabilidad especificados."
              ]
            }
  	]
}