{
  "Mantenibilidad": {
    "Subcaracteristicas": [
      {
        "Analizabilidad": {
          "Metricas": [
            {
              "id": 0,
              "nombre": "Grabación de Actividad",
              "proposito": ["¿Cuán completa es la grabación del estado del sistema?"],
              "metodo": ["Cuente el número de elementos registrados en el registro de actividades tal como se especifica y compárelo con el número de elementos que se desea registrar."],
              "formula": ["A/B"],
              "peor_valor": 0,
              "mejor_valor": 1,
              "parametros": [
                "A",
                "B"
              ],
              "desc_param": [
                "A: Número de elementos de entrada de datos implementados como se especifica confirmado en la revisión",
                "B: Número de elementos de datos que se deben registrar en las especificaciones."
              ]
            },
            {
            	"id": 1,
	            "nombre": "Disponibilidad de la función de diagnóstico",
	            "proposito": ["¿Cuán completa es la provisión de las funciones de diagnóstico?"],
	            "metodo": ["Cuente el número de funciones de diagnóstico implementadas según lo especificado y compárelo con el número de funciones de diagnóstico requerido en las especificaciones."],
	            "formula": ["A/B"],
	            "peor_valor": 0,
	            "mejor_valor": 1,
	            "parametros": [
	              "A",
	              "B"
	            ],
	            "desc_param": [
	              "A: Número de funciones de diagnóstico implementadas como se especifica confirmado en la revisión",
	              "B: Número de funciones de diagnóstico necesarias."
              ]
            }
          ]
        },
        "Modificabilidad" : {
          "Metricas": [
            {
              "id": 0,
              "nombre": "Capacidad de cambio de los registros ",
              "proposito": ["¿Los cambios en las especificaciones y módulos de programa están registrados adecuadamente en el código con las líneas de comentario?"],
              "metodo": ["Registro de proporción de información de cambio de módulo."],
              "formula": ["A/B"],
              "peor_valor": 0,
              "mejor_valor": 1,
              "parametros": [
                "A",
                "B"
              ],
              "desc_param": [
                "A: Número de cambios en funciones/módulos que tienen comentarios de cambio confirmados en la revisión",
                "B: Número total de funciones/módulos cambiados del código original."
              ]
            }
          ]
        },
        "Estabilidad" : {
          "Metricas": [
            {
              "id": 0,
              "nombre": "Impacto de cambio",
              "proposito": ["¿Cuál es la frecuencia de los impactos adversos después de la modificación?"],
              "metodo": ["Cuente el número de impactos adversos detectados después de la modificación y compárelos con el número de modificaciones realizadas."],
              "formula": ["1 - A/B"],
              "peor_valor": 0,
              "mejor_valor": 1,
              "parametros": [
                "A",
                "B"
              ],
              "desc_param": [
                "A: Número de impactos adversos detectados después de las modificaciones.",
                "B: Número de modificaciones realizadas."
              ]
            },
            {
            	"id": 1,
	            "nombre": "Localización del impacto de una modificación ",
	            "proposito": ["¿Qué tan grande es el impacto de la modificación en el producto de software?"],
	            "metodo": ["Cuente el número de variables afectadas de una modificación y compárelo con el número total de variables del producto."],
	            "formula": ["A/B"],
	            "peor_valor": 1,
	            "mejor_valor": 0,
	            "parametros": [
	              "A",
	              "B"
	            ],
	            "desc_param": [
	              "A: Número de datos de las variables afectadas por modificación, confirmado en la revisión.",
	              "B: Número total de variables."
              ]
            }
          ]
        },
        "Testeabilidad" : {
          "Metricas": [
            {
              "id": 0,
              "nombre": "Integridad de la función de prueba incorporada",
              "proposito": ["¿Qué tan completa es la capacidad de prueba incorporada?"],
              "metodo": ["Cuente el número de funciones de prueba integradas implementadas según lo especificado y compárelo con el número de funciones de prueba incorporadas en los requisitos."],
              "formula": ["A/B"],
              "peor_valor": 0,
              "mejor_valor": 1,
              "parametros": [
                "A",
                "B"
              ],
              "desc_param": [
                "A: Número de funciones de prueba integradas implementadas según lo especificado confirmado en la revisión",
                "B: Número de funciones de prueba incorporadas necesarias."
              ]
            },
            {
            	"id": 1,
	            "nombre": "Autonomía de la capacidad de prueba",
	            "proposito": ["¿Cómo se puede probar independientemente el software?"],
	            "metodo": ["Cuente el número de dependencias de otros sistemas para las pruebas que se han simulado con talones y compárelo con el número total de las dependencias de la prueba en otros sistemas."],
	            "formula": "A/B",
	            "peor_valor": 0,
	            "mejor_valor": 1,
	            "parametros": [
	              "A",
	              "B"
	            ],
	            "desc_param": [
	              "A: Número de dependencias de otros sistemas para las pruebas que se han simulado con talones",
	              "B: Número total de las dependencias de la prueba en otros sistemas."
              ]
            },
            {
            	"id": 2,
	            "nombre": "Observabilidad del progreso de la prueba",
	            "proposito": ["¿Cuán completas son las visualizaciones de resultados de prueba incorporadas durante las pruebas?"],
	            "metodo": ["Cuente el número de puntos de control implementados según lo especificado y compárelo con el número de puntos de verificación especificado requerido por el diseño."],
	            "formula": ["A/B"],
	            "peor_valor": 0,
	            "mejor_valor": 1,
	            "parametros": [
	              "A",
	              "B"
	            ],
	            "desc_param": [
	              "A: Número de puntos de control implementados según los especificados confirmados en la revisión.",
	              "B: Número de puntos de control diseñados."
              ]
            }
          ]
        },
        "CumplimientoMantenibilidad" : {
          "Metricas": [
            {
              "id": 0,
              "nombre": "Cumplimiento de la Mantenibilidad",
              "proposito": ["¿En qué medida es compatibles la mantenibildiad del producto de software a las regulaciones, normas y convenciones?"],
              "metodo": ["Cuente el número de ítems que requieren cumplimiento que se han cumplido y compare con el número de ítems que requieren cumplimiento como en la especificación."],
              "formula": ["A/B"],
              "peor_valor": 0,
              "mejor_valor": 1,
              "parametros": [
                "A",
                "B"
              ],
              "desc_param": [
                "A: Número de elementos correctamente implementados relacionados con el cumplimiento de mantenibilidad confirmados en la evaluación",
                "B: Número total de elementos de cumplimiento."
              ]
            }
          ]
        }
      }
    ],
    "Perspectiva" : "interna"
  }
}